/*
 * Задача 8: «Фибоначчи»
 *
 * Последовательность Фибоначчи — это порядок чисел, где каждое последующее
 * число является суммой двух предыдущих: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34.
 * 
 * Напишите функцию, которая принимает на вход число n и возвращает n-й элемент
 * последовательности Фибоначчи.
*/

function fibonacci(n) {
    let summ = 0;
    let first = 0;
    let twice = 1;
    for (let j = 1; j < n; j++) {
        summ = first + twice;
        first = twice;
        twice = summ;
    }
    return first
    // Напишите код здесь
}

// Протестируйте решение, вызывая функцию с разными аргументами:

console.log(fibonacci(0)); // 2. Четвёртое число последовательности — двойка (0, 1, 1, 2)