/*
 * Задача 4: «С большой буквы»
 *
 * Напишите функцию capitalize(str). Функция должна возвращать новую
 * строку каждое слово в которой начинается с прописной буквы.
 *
*/

function capitalize(str) {
    str = str.split(' ');

    for (let i = 0; i < str.length; i++) {
        if (str[i] !== '') {
            str[i] = str[i][0].toUpperCase() + str[i].slice([1]);
        } 
    }
    return str.join(' ')
    // Напишите код здесь
}

// Протестируйте решение, вызывая функцию с разными аргументами:

console.log(capitalize('молодость всё простит')); // "Молодость Всё Простит"