/*
 * Задача 14: «Простые числа»
 *
 * Напишите функцию primes(n). Её единственный аргумент — целое число n.
 * Функция должна возвращать массив простых чисел от 2 до n.
 * 
*/

function primes(num) {
    const arr = [];

    for (let i = 2; i <= num; i++) {
        let k = 1;

        for (let j = i; j > 1; j--) {
            if (i % j === 0) {
                k += 1;
            }
        }

        if (k === 2) {
            arr.push(i);
        }
    }
    return arr;
    // Напишите код здесь
}

// Протестируйте решение, вызывая функцию с разными аргументами:

console.log(primes(6)); // [2, 3, 5]
console.log(primes(17)); // [2, 3, 5, 7, 11, 13, 17]